<?php

/*
Кожна змінна має свій тип. Тип змінної визначається типом даних, 
які можуть бути значеннями цієї змінної.
Змінні в PHP динамічно типізовані, це дає нам змогу пропустити 
оголошення типу змінної на початку її створення.

Типи змінних:
PHP підтримує десять найпростіших типів.
Чотири скалярні типи: 
• bool
• int (цілі числа)
• float (число з плаваючою точкою, також відоме як double) 
• string
*/

$available = true;
// $available = TRUE;
$unavailable = FALSE;
$age = 18;
$PI = 3.14;
$negative = -10;
$hello = 'Привіт як справи?';
$goodBye = "До нових зустрічей!";
var_dump($goodBye);

/*
Чотири змішані типи: 
• array
• object 
• callable 
• iterable

І два спеціальні типи: 
• resource
• NULL
*/
$empty = NULL;
// $empty = null;