<?php

/*
Кожна змінна має свій тип. Тип змінної визначається типом даних, 
які можуть бути значеннями цієї змінної.
Змінні в PHP динамічно типізовані, це дає нам змогу пропустити 
оголошення типу змінної на початку її створення.

Тип даних - характеристика набору даних, яка визначає:
1. діапазон можливих значень;
2. допустимі операції, які можна виконувати над цими значеннями;
3. спосіб зберігання цих значень у пам'яті.

Типи змінних:
PHP підтримує десять найпростіших типів.
Чотири скалярні типи: 
• bool (boolean)
виражає істинність значення. Можливі значення: TRUE, або FALSE.

• int (integer)
це цілі числа з множини Z = {..., -2, -1, 0, 1, 2, ...}.

• float (також відоме як double) 
це числа з плаваючою точкою.

• string (рядок) 
це набір символів, де символ - це те ж саме, що і байт. Це 
означає, що PHP підтримує рівно 256 різних символів, а також те, 
що в PHP немає вбудованої підтримки Unicode.

Так само до простих типів належать два спеціальні типи:
• resource 
це особливий тип даних у PHP. Значення типу Resource є посиланням 
на зовнішнє джерело. Посилання являє собою звичайний рядок з 
ідентифікатором, який інтерпретатор використовує для взаємодії із 
зовнішнім джерелом. Ресурси створюються і використовуються 
спеціальними функціями.

• NULL 
має лише одне значення - null. Це значення є константою і вона не 
чутлива до регістру символів. 
Отримати значення null можна таким чином:
- При зверненні до змінної, яка не була ініціалізована.
- Змінній безпосередньо було присвоєно константу null.
- При зверненні до змінної, яка була видалена за допомогою unset().

До складових типів даних належать:
• array (масиви)
Масивом можна вважати різновид змінних, у яких зберігаються кілька 
значень. Масив визначається за допомогою конструкції array()

• object (об'єкти)
є одним із базових понять об'єктно-орієнтованого програмування та 
являє собою змінну, екземпляр якої створюють за спеціальним шаблоном, 
який називають класом.

Також:
• callable (функції)
• mixed (будь-який тип)

- gettype - метод, що повертає тип змінної.
- settype - метод, що встановлює тип змінної.
*/

$available = true;
// $available = TRUE;
$unavailable = FALSE;
$age = 18;
$PI = 3.14;
$negative = -10;
$hello = 'Привіт як справи?';
$goodBye = "До нових зустрічей!";
var_dump($goodBye);

$empty = NULL;
// $empty = null;

// Отримання типу змінної
echo "</br>" . gettype($available) . "</br>";
echo gettype($negative) . "</br>";
echo gettype($PI) . "</br>";
echo gettype($goodBye) . "</br>";
echo gettype($empty) . "</br>";

// Перетворення типу змінної
settype($PI, "integer");
echo $PI . ' = ' . gettype($PI) . "</br>";