<?php

/*
Конструкції мови PHP, які дають змогу виводити 
текст на екран:
- echo 
- print 
Конструкція print відрізняється від echo тим, що 
echo може приймати список аргументів для виведення.

- printf - функція форматного виведення тексту. Формат 
виведення визначається символом "%".
Формати виведення:
1. b - ціле число, що подається в двійковому вигляді;
2. с - ціле число, що подається у вигляді символу з тим 
самим ASCII кодом;
3. d - ціле число, що подається в десятковому вигляді;
4. f - число з плаваючою крапкою, що подається у вигляді 
десяткового дробу;
5. o - ціле число, що подається у вісімковому вигляді;
6. s - рядок;
7. x - ціле число, що подається в шістнадцятковому вигляді 
в нижньому регістрі;
8. X - ціле число, що подається в шістнадцятковому вигляді 
у верхньому регістрі.

Найпоширеніша операція з рядками - це їх конкатенація, 
або приєднання до одного рядка іншого. Для конкатенації 
рядків ввели спеціальний оператор "."
echo "Hello world"; еквівалентна echo "Hello ". "world""

Однорядкові символи для початку коментування рядка: # та // 
*/

echo "Hello, world!</br>";
print("Hello, PHP!");
printf("%s", "</br>Hello, everyone!</br>");

function greeting()
{
  echo "Hello from function ;)";
}

greeting();
echo "</br>";

function showText($text)
{
  echo $text;
}

showText("I'm glad to see you...");
echo "</br>";

// А це однорядковий коментар
# це також  однорядковий коментар