<?php

/*
Умовна конструкція if-elseif-else 
дозволяє направити роботу програми в залежності 
від умови по одному з кількох можливих шляхів.
*/

// Інструкція if-elseif-else
$hour = 12;

if ($hour < 12) {
  echo "Ще ранок!";
} elseif ($hour == 12) {
  echo "Зараз опівдень!";
} else {
  echo "Уже вечір!";
}
echo "<br>";


$money = 32;

if ($money < 20) {
  echo "У вас недостатньо грошей";
} elseif ($money < 25) {
  echo "У вас, як і раніше, недостатньо грошей";
} elseif ($money > 30) {
  echo "У вас достатньо грошей для придбання цього товару";
} else {
  echo "Перегляньте інші товари";
}