<?php

// task 1
$str = 'learn-ph@example.com';

echo "<b>Task 1:</b><br>";
// bin2hex - повертає ASCII-рядок, що містить шістнадцяткове 
// представлення аргументу string. Перетворення виконується 
// побайтно, починаючи зі старшого напівбайта:
echo bin2hex($str);
echo "<hr>";

// task 2
$str = 'The brown fox';
$strToInsert = 'quick';
$insertPos = 4;

/*
substr_replace( string, replacement, start, [length] ) -
замінює частину рядка string, що починається з символу 
з порядковим номером start і довжиною length, рядком 
replacement і повертає результат. 
Якщо start - додатне число, заміна починається із символу 
з порядковим номером start. 
Якщо start - від'ємне число, заміна починається із символу 
з порядковим номером start, рахуючи від кінця рядка.
Якщо аргумент length - додатне число, то він визначає довжину 
замінного підрядка. 
Якщо цей аргумент від'ємний, він визначає кількість символів 
від кінця рядка, на якому закінчується заміна. Цей аргумент 
необов'язковий і за замовчуванням дорівнює strlen(string );, 
тобто заміна до кінця рядка string.
Якщо length дорівнює нулю, то це еквівалентно вставці replace 
у string на зазначеній позиції start.
*/
$newStr = substr_replace($str, $strToInsert . ' ', $insertPos, 0);

echo "<b>Task 2:</b><br>";
echo $newStr;
echo "<hr>";