<?php

/*
Heap - це спеціалізована деревоподібна структура даних. 
Вона відрізняється від звичайних списків і масивів тим, 
що має певне правило розподілу елементів. Кожен вузол у 
купі має значення, і це значення пов'язане з його нащадками 
таким чином, що вузол із певним значенням завжди перебуває в 
певній позиції щодо своїх нащадків. Це називається повним 
бінарним деревом.
*/

$heap = new SplMinHeap();
$heap->insert(123);
$heap->insert(44);
$heap->insert(54);
$heap->insert(711);
$heap->insert(29);

echo '<pre>';
var_dump([
  $heap->extract(),
  $heap->extract(),
  $heap->extract(),
]);
echo '</pre>';