<?php

/*
Змінна - іменована або адресована іншим способом область пам'яті, 
адресу якої можна використовувати для здійснення доступу до даних 
і зміни значень під час виконання програми.

Позначення змінної:
• Перед іменем завжди ставиться знак долара $
• Першою йде буква, за нею можуть йти букви та цифри
• Ім'я реєстрозалежне
$var і $Var - 2 різні змінні

Правила:
1. Не можна використовувати пробіл в імені змінної
2. Не можна щоб ім'я змінної починалося з цифри
3. Змінна повинна починатися із символу $.

Область видимості змінних - це контекст, у межах якого змінна була 
визначена і де до неї можна отримати доступ. 
У PHP є дві області видимості змінних:
- Глобальна - 
до змінних можна отримати доступ у будь-якому місці скрипта.
-Локальна - 
до змінних можна отримати доступ тільки всередині функції, в 
якій вони були визначені.
*/
// $aZ_ = 'value';
$myFirstVar = 'PHP Variable';
var_dump($myFirstVar);

// Дії зі змінними:
// Присвоєння значення
$name = "Nadiia";
// перевірка існування
$isAgeSet = isset($age);
$isNameSet = isset($name);
// знищення
unset($name);
// var_dump($name);