<?php

/*
MVC - архітектурний патерн.
Архітектурний патерн - патерн, який описує основні моменти роботи
додатка.
Головна особливість MVC - простий поділ обов'язків класів. Ніхто не 
лізе з чужими обов'язками до сусіда (відтворення в моделі тощо). Усі 
дії відбуваються в потрібних обробниках, у потрібних місцях.

Принципи MVC
- Model - шар застосунку, в якому міститься бізнес-логіка.
- View - шар застосунку, який віддає (відмальовує) користувачеві дані, отримані з
бізнес-логіки.
- Controller - посередник, який з'єднує model з view. Приймає запит, диригує даними, 
надсилає відповідь користувачеві.
*/

require_once 'helpers/ns_loader.php';

use controller\Controller;

$controller = new Controller();
$html = $controller->actionIndex();
echo $html;