<?php

/*
- file_get_contents - читає вміст файлу в рядок. 
- file_put_contents - пише рядок у файл.
- fgets - функція рядкового зчитування файлу.

Функції читання та запису файлів:
fopen('file.txt', 'r'); - відкриття файлу
fwrite($fp, $mytext); - запис у файл. 
fgets($fp, 1000); - читати файл порядково. 
fclose($fp); - закриття файлу.

r - відкриття файлу тільки для читання.
r+ - відкриття файлу одночасно на читання і запис.
w - створення нового порожнього файлу. Якщо на момент 
виклику вже існує такий файл, то він знищується.
w+ - аналогічний r+, тільки якщо на момент виклику файл 
такий існує, його вміст видаляється.
a - відкриває наявний файл у режимі запису, при цьому 
покажчик зсувається на останній байт файлу (на кінець 
файлу).
a+ - відкриває файл у режимі читання і запису, при цьому 
покажчик зсувається на останній байт файлу (на кінець 
файлу). Вміст файлу не видаляється.

- Не кожен прапор відкриття файлу дає право на запис.
- Після роботи з файлом бажано його закривати.
- Видалити папку можна тільки в разі якщо вона порожня.

Функції роботи з папками та файлами:
- mkdir() - створити папку
- rmdir() - видаляє папку (папка має бути порожньою). 
- scandir() - виводить увесь вміст директорії. 
- chmod() - встановлює права на паки та файли. 
- unlink() - видаляє файл.
*/

$myfile = fopen("file.txt", "w") or die ("Неможливо відкрити файл!");
$txt = "John Doe\n";
fwrite($myfile, $txt);
$txt = "Jane Doe\n";
fwrite($myfile, $txt);
fclose($myfile);

//"newfile.txt" містить деякі дані і коли ми відкриваємо існуючий файл 
// для запису, то усі наявні дані буде стерто, і ми почнемо з порожнього 
// файлу.
$myfile = fopen("file.txt", "w") or die ("Неможливо відкрити файл!");
$txt = "Mickey Mouse\n";
fwrite($myfile, $txt);
$txt = "Minnie Mouse\n";
fwrite($myfile, $txt);
fclose($myfile);

// "a" режим додає текст у кінець файлу, тоді як "w" режим перевизначає 
// (і стирає) старий вміст файлу.
$myfile = fopen("file.txt", "a") or die ("Неможливо відкрити файл!");
$txt = "Donald Tramp\n";
fwrite($myfile, $txt);
$txt = "Goofy Goof\n";
fwrite($myfile, $txt);
fclose($myfile);

// Перший параметр fread() містить назву файлу для читання, а другий 
// параметр визначає максимальну кількість байтів для читання.
$myfile = fopen("file.txt", "r") or die ("Неможливо відкрити файл!");
echo fread($myfile, filesize("file.txt")) . '<hr>';
fclose($myfile);

// Функція fgets() використовується для читання одного рядка з файлу.
$myfile = fopen("file.txt", "r") or die ("Неможливо відкрити файл!");
echo fgets($myfile) . '<hr>';
fclose($myfile);

// Функція feof() 
// - корисна для циклічного перегляду даних невідомої довжини.
// - перевіряє, чи "end-of-file" (EOF) ("кінець файлу") досягнуто.
$myfile = fopen("file.txt", "r") or die ("Неможливо відкрити файл!");
// Вивести один рядок до кінця файлу
while (!feof($myfile)) {
  echo fgets($myfile) . "<br>";
}
fclose($myfile);
echo '<hr>';

// Функція fgetc() використовується для читання окремого символу з файлу.
$myfile = fopen("file.txt", "r") or die ("Неможливо відкрити файл!");
// Вивести один символ до кінця файлу
while (!feof($myfile)) {
  echo fgetc($myfile) . "<br>";
}
fclose($myfile);