<?php

/*
Константа:
Константа – іменована область пам'яті, значення якої не змінюється протягом роботи програми.
define:
• Реєстронезалежна
• Можна використовувати в циклах/виразах/функціях
• Oголошує константи під час виконання скрипту

const
• Завжди реєстрозалежна 
• Не можна використовувати вциклах/виразах/функціях 
• Oголошує константи під час компіляції
• Не може бути використана для динамічно оголошених констант.

const та define можуть зберігати тільки скалярні типи та array.
*/

define('TEXT', 'Привіт я константа.');
// define('TEXT', false);
// define('TEXT', 25);
// define('TEXT', 14.89);

const PATH_TO_MY_PROJECT = "/some/path/to/my/project";
const CONSTANT_VALUE = "Constant PHP";
// var_dump(CONSTANT_VALUE);

define('DATA', [true, 'Привіт', 10, 55.12]);
$isData = defined('DATA');
var_dump($isData);