<?php

/*
Автозавантаження - механізм мови PHP, який дає змогу гнучко підключати файли класів.
Здебільшого це реалізується якимось окремим класом, який вміє правильно шукати, де ж 
знаходяться інші класи програми.

Механізм простору імен
Головне його завдання - уникнення колізії імен.
-Це досягається шляхом додавання до імені класу додаткового унікального 
префікса namespace, внаслідок чого в ідеальній системі існуватиме єдина 
унікальна пара namespace + ім'я класу.

2 види namespace:
- глобальні (мають глобальний простір імен(\) ==> \Traversable )
- локальні (мають конкретний простір імен ==> ns1\User)
*/

// простори імен
use data\Test1;
use data\Test2;

spl_autoload_register(function (string $className) {
  $path = str_replace('\\', '/', $className) . '.php';
  require_once $path;
});

$data = new Test1();
$data2 = new Test2();

var_dump([
  $data->getData(),
  $data2->getData()
]);