<?php

/*
У PHP є кілька механізмів для реалізації роботи з масивом даних:
- Простий перебір через for/foreach 
- Ітератори
- Генератори

Простий перебір хороший тільки на маленьких обсягах даних. Якщо 
виникає завдання перебрати великий пул даних, простий перебір стає 
занадто витратним за ресурсами, і його потрібно замінити на механізм 
ітераторів або генераторів. Головна їхня суть - надати знайомий 
програмісту foreach API, який дасть змогу, не змінюючи істотно коду 
foreach-а, сильно виграти за продуктивністю і ресурсами. Для цього 
дані розбиваються і видаються маленькими порціями, що дає змогу 
істотно знизити всі можливі види витрат.

Так само, іноді виникає завдання працювати з якимось об'єктом як з 
масивом, тоді ми можемо використовувати SPL клас ArrayObject, або його 
надбудову, написану самостійно.

Об'єкт, як масив потрібен для:
- Імітація роботи масиву
- Перебір великої к-сті даних

Є кілька способів взаємодіяти з об'єктом як з масивом:
- SPL ARRAY Object
- iterator
- generator
*/

// SPL array object
$data = new ArrayObject();

$data['x'] = 123;
$data['name'] = 'Alex';

var_dump([
  $data['x'],
  $data['name']
]);