<?php

/*
Парадигма – підхід до написання програми.
ООП – об'єктно-орієнтована парадигма проектування. В центрі уваги -
об'єкти та класи.

Клас - шаблон
Властивість – характеристика класу.
Метод – функція класу.
Об'єкт (екземпляр класу) - конкретна реалізація; щось створене з урахуванням шаблона
Об'єкти створюються за допомогою конструкції мови new, наприклад: new User.

Усі значення в PHP можна передавати або за значенням або за посиланням:
- Передача значення – передається копія значення.
- Надсилання за посиланням – передає посилання на місце в пам'яті, де зберігається значення.

Об'єкти так само, як і інші типи даних, можна порівнювати.
Об'єкти нестрого рівні, якщо всі їхні властивості рівні.
Об'єкти строго рівні, лише якщо порівнюється сам із собою той самий об'єкт.
*/

// Порядок дій:
// 1. Створити клас
// 2. Створити необхідні нам екземпляри класу
// шаблон кота
class Cat
{
}

// шаблон змії
class Snake
{
}

// екземпляри класу Cat
$murzik = new Cat();
$barsik = new Cat();
$barsik2 = new Cat();


// екземпляри класу Snake
$kaa = new Snake();
$anaconda = new Snake();

class Human
{
  public $name;    //null
  public $surname; //null
  public $age = 0; //0

  public function sayHello()
  {
    return "Hello!";
  }
}

$user = new Human();
$user->name = "Nadiia";
$user->surname = "Kuzmich";
$user->age = 27;

echo "Username -> $user->name <br>";
echo $user->sayHello();