<?php

/*
Цикл - різновид керуючої конструкції у високорівневих мовах програмування, 
призначений для організації багаторазового виконання набору інструкцій.

Ітерація в програмуванні - організація обробки даних, за якої дії 
повторюються багаторазово, не призводячи при цьому до викликів самих себе.
Говорячи простими словами - це один крок циклу, який виконає всі вкладені 
інструкції і за умовою перейде до наступної ітерації.

Цикл із постумовою do-while.
Головна відмінність циклу while від do-while в тому, що do-while завжди 
виконується хоча б один раз, навіть якщо умова від початку хибна.
*/

$i = 0;
do {
  echo $i++;
} while ($i < 0);
echo '<hr>';

$week = [
  'Понеділок',
  'Вівторок',
  'Середа',
  'Четвер',
  'П\'ятниця',
  'Субота',
  'Неділя'
];

$day = 0;

do {
  echo $week[$day] . "<br>";
  $day++;
} while ($day < count($week));