<?php

/*
Цикл foreach
Конструкція foreach надає простий спосіб перебору масивів.
Foreach працює тільки з масивами та об'єктами, і буде генерувати 
помилку при спробі використання зі змінними інших типів або 
неініціалізованими змінними.

foreach (масив as значення) { 
  тіло_цикла;
}

foreach (масив as ключ => значення) { 
  тіло_цикла;
}

breack
- часто буває зручно при виникненні деяких умов мати можливість 
достроково завершити цикл. Таку можливість надає оператор break. 
Він працює з такими конструкціями як: while, do while, for, foreach 
або switch.

continue 
- використовується всередині циклічних структур для пропуску частини 
поточної ітерації циклу, що залишилася, і, за дотримання умов, початку 
наступної ітерації.
*/

$nums = [1, 2, 3, 4];

foreach ($nums as $num) {
  if ($num % 2 === 0) {
    echo $num . "<br>";
  }
}

foreach ($nums as $num) {
  if ($num % 2 !== 0) {
    continue;
  }

  echo $num . "<br>";
}

$persons = [
  "Ігор" => "25",
  "Тарас" => "17",
  "Тетяна" => "21"
];

foreach ($persons as $name => $age) {
  echo "Ім'я: " . $name . ". Вік: " . $age . ". <br>";
}